In [1]:
#augument the zip-code nyc geojson data
import geopandas as gpd
import matplotlib.pyplot as plt
import os
import json
import pandas as pd
import numpy as np

In [2]:
# Print current working directory
print(f"Current directory: {os.getcwd()}")

# Change to parent directory
os.chdir('..')

Current directory: /Users/apple/Documents/GitHub/data_science_project/notebooks

In [3]:
demo_df=pd.read_csv('clean_data/clean_demographics_data.csv')
demo_df.head()

,zip_code,total_population,male_population,female_population,age_under_18,age_18_to_44,age_45_plus,race_white,race_native_american,race_asian
0,6390,53.0,37.0,16.0,8.0,24.0,21.0,31.0,0.0,0.0
1,10001,29079.0,14069.0,15010.0,4010.6,15181.4,6331.0,15893.0,32.0,5228.0
2,10002,75517.0,38110.0,37407.0,10757.2,28954.8,18537.0,23597.0,262.0,27700.0
3,10003,53825.0,26407.0,27418.0,9148.8,27316.2,9077.0,36193.0,68.0,9639.0
4,10004,3875.0,2118.0,1757.0,793.8,2117.2,787.0,2460.0,0.0,923.0

In [4]:
len(demo_df)

1824

In [5]:
edu_df=pd.read_csv('clean_data/clean_education_data.csv')
edu_df.head()

,zip_code,pop_25_over,pct_bachelors_plus_25_over,count_bachelors_plus_25_over,pop_18_24,pct_bachelor_and_over_18_24,count_bachelors_plus_18_24
0,6390,38.0,39.5,15.0,7.0,100.0,7.0
1,10001,22724.0,71.5,16248.0,3033.0,33.5,1016.0
2,10002,59418.0,39.0,23173.0,5978.0,30.8,1841.0
3,10003,36544.0,82.2,30039.0,13489.0,24.2,3264.0
4,10004,3010.0,90.9,2736.0,89.0,33.7,30.0

In [6]:
len(edu_df)

1824

In [7]:
income_df=pd.read_csv('clean_data/clean_income_data.csv')
income_df.head()
income_df.dropna(inplace=True)

In [8]:
income_df.head()

   zip_code  Median_Household_Income
1    6390.0                     17.0
2   10001.0                  15097.0
3   10002.0                  35771.0
4   10003.0                  25080.0
5   10004.0                   1775.0

In [9]:
len(income_df)

1824

In [10]:
chain_store_df=pd.read_csv('clean_data/nyc_chain_stores.csv')
chain_store_df.head()

              DBA Name  License Number  County  Zip Code  Square Footage
0  EDIBLE ARRANGEMENTS              48      20        48     1425.365854
1             KEY FOOD              45       7        41    12451.351351
2               C TOWN              40       7        37    11378.378378
3           MOBIL MART              33      12        28     1537.757576
4    IDEAL FOOD BASKET              26       6        21    14700.000000

In [11]:
ain_store_df = chain_store_df.sort_values('License Number', ascending=False)
top_5_chains = chain_store_df.head(5)
top_5_chain_names=top_5_chains['DBA Name'].tolist()

In [12]:
remote_df=pd.read_csv('clean_data/nyc_remote_work_by_district.csv')
remote_df.head()

,district_simple,total_workers,commuting_workers,remote_workers,remote_pct
0,Manhattan CD3 - Lower East Side & Chinatown,133718,71201,62517,46.8
1,Manhattan CD4 - Chelsea & Hell's Kitchen,112097,75883,36214,32.3
2,Manhattan CD7 - Upper West Side,185973,118279,67694,36.4
3,Manhattan CD8 - Upper East Side & Roosevelt Is...,176157,117825,58332,33.1
4,Manhattan CD9 - Morningside Heights & Hamilton...,99184,49332,49852,50.3

In [13]:
len(remote_df)

55

In [14]:
pop_df=pd.read_csv('clean_data/population_clean.csv')

In [15]:
store_count=pd.read_csv('clean_data/store_counts_by_zip.csv')
store_count.head()

   Zip_Code_Clean  store_count  grocery_count  specialty_count
0           10001           46             14                9
1           10002          129             15               32
2           10003           59             15               18
3           10004            5              3                0
4           10005            7              1                2

In [16]:
len(store_count)

187

In [17]:
store_details=pd.read_csv('clean_data/store_details.csv')
store_details.head()

,store_name,square_footage,operation_type,georeference,Zip_Code_Clean
0,SKILLMART,NaN,Store,POINT (-73.955486796 40.690346184),11205
1,BENJAMINS PHARMACY & SURGICAL,NaN,Store,POINT (-73.858823252 40.865713996),10469
2,BALDE FAMILY GENERAL MERCHANDISING,NaN,Store,POINT (-73.864832322 40.871259212),10467
3,ESTRELLA MEATS FRUITS & GROCERY 2,NaN,Store,POINT (-73.872836453 40.878631389),10467
4,HUA-TE NY,NaN,Store,POINT (-73.828313124 40.754958503),11355

In [18]:
zip_df=pd.read_csv('clean_data/zips_df.csv')
#change postal code to zip code
zip_df['zip_code'] = zip_df['postalCode']
zip_df.drop('postalCode', axis=1, inplace=True)
zip_df.head()

,Unnamed: 0,shape_area,borough,PO_NAME,area_sqkm,area_sqmi,zip_code
0,0,3.830099e+07,Manhattan,Central Park,38.300990,14.788089,83
1,1,1.779494e+07,Manhattan,New York,17.794941,6.870662,10001
2,2,2.628013e+07,Manhattan,New York,26.280129,10.146810,10002
3,3,1.553838e+07,Manhattan,New York,15.538376,5.999398,10003
4,4,1.355481e+07,Manhattan,New York,13.554813,5.233541,10004

In [19]:
len(zip_df)

247

In [20]:
zip_df_subset = zip_df[['shape_area', 'borough', 'PO_NAME', 'area_sqkm', 'area_sqmi', 'zip_code']]

# Merge!

zip_df and demo_df

In [21]:
demographic_education_df = pd.merge(
    demo_df,
    edu_df,
    on='zip_code',
    how='inner'
)

In [22]:
merged_df = pd.merge(
    demographic_education_df,
    zip_df_subset,  # Only select the zip_code column from zip_df
    on='zip_code',
    how='right'  # right join to keep  matching nyc zip codes
)

In [23]:
len(merged_df)

247

In [24]:
#check empty values
missing_values = merged_df.isnull().sum()
missing_values = missing_values[missing_values > 0]
missing_values = missing_values.reset_index()
missing_values.columns = ['Column', 'Missing Values']
missing_values = missing_values.sort_values(by='Missing Values', ascending=False)
missing_values = missing_values[missing_values['Missing Values'] > 0]
missing_values = missing_values.reset_index(drop=True)
print(missing_values)

                          Column  Missing Values
0    pct_bachelor_and_over_18_24              64
1     count_bachelors_plus_18_24              64
2     pct_bachelors_plus_25_over              63
3   count_bachelors_plus_25_over              63
4               total_population              38
5                male_population              38
6              female_population              38
7                   age_under_18              38
8                   age_18_to_44              38
9                    age_45_plus              38
10                    race_white              38
11          race_native_american              38
12                    race_asian              38
13                   pop_25_over              38
14                     pop_18_24              38

In [25]:
merged_df.head()

,zip_code,total_population,male_population,female_population,age_under_18,age_18_to_44,age_45_plus,race_white,race_native_american,race_asian,...,pct_bachelors_plus_25_over,count_bachelors_plus_25_over,pop_18_24,pct_bachelor_and_over_18_24,count_bachelors_plus_18_24,shape_area,borough,PO_NAME,area_sqkm,area_sqmi
0,83,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,3.830099e+07,Manhattan,Central Park,38.300990,14.788089
1,10001,29079.0,14069.0,15010.0,4010.6,15181.4,6331.0,15893.0,32.0,5228.0,...,71.5,16248.0,3033.0,33.5,1016.0,1.779494e+07,Manhattan,New York,17.794941,6.870662
2,10002,75517.0,38110.0,37407.0,10757.2,28954.8,18537.0,23597.0,262.0,27700.0,...,39.0,23173.0,5978.0,30.8,1841.0,2.628013e+07,Manhattan,New York,26.280129,10.146810
3,10003,53825.0,26407.0,27418.0,9148.8,27316.2,9077.0,36193.0,68.0,9639.0,...,82.2,30039.0,13489.0,24.2,3264.0,1.553838e+07,Manhattan,New York,15.538376,5.999398
4,10004,3875.0,2118.0,1757.0,793.8,2117.2,787.0,2460.0,0.0,923.0,...,90.9,2736.0,89.0,33.7,30.0,1.355481e+07,Manhattan,New York,13.554813,5.233541

In [26]:
merged_df.columns.to_list()

['zip_code',
 'total_population',
 'male_population',
 'female_population',
 'age_under_18',
 'age_18_to_44',
 'age_45_plus',
 'race_white',
 'race_native_american',
 'race_asian',
 'pop_25_over',
 'pct_bachelors_plus_25_over',
 'count_bachelors_plus_25_over',
 'pop_18_24',
 'pct_bachelor_and_over_18_24',
 'count_bachelors_plus_18_24',
 'shape_area',
 'borough',
 'PO_NAME',
 'area_sqkm',
 'area_sqmi']

## Feature Engineering

In [27]:
merged_df['population_density'] = merged_df['total_population'] / merged_df['area_sqkm']

In [28]:
merged_df['Education Index']=merged_df['pct_bachelors_plus_25_over']+merged_df['pct_bachelor_and_over_18_24']

In [29]:
merged_df = pd.merge(merged_df, store_count[['Zip_Code_Clean', 'store_count', 'grocery_count', 'specialty_count']], 
                    left_on='zip_code', right_on='Zip_Code_Clean', how='left')
merged_df.drop('Zip_Code_Clean', axis=1, inplace=True)

In [30]:
merged_df.head()

,zip_code,total_population,male_population,female_population,age_under_18,age_18_to_44,age_45_plus,race_white,race_native_american,race_asian,...,shape_area,borough,PO_NAME,area_sqkm,area_sqmi,population_density,Education Index,store_count,grocery_count,specialty_count
0,83,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,3.830099e+07,Manhattan,Central Park,38.300990,14.788089,NaN,NaN,NaN,NaN,NaN
1,10001,29079.0,14069.0,15010.0,4010.6,15181.4,6331.0,15893.0,32.0,5228.0,...,1.779494e+07,Manhattan,New York,17.794941,6.870662,1634.116144,105.0,46.0,14.0,9.0
2,10002,75517.0,38110.0,37407.0,10757.2,28954.8,18537.0,23597.0,262.0,27700.0,...,2.628013e+07,Manhattan,New York,26.280129,10.146810,2873.539973,69.8,129.0,15.0,32.0
3,10003,53825.0,26407.0,27418.0,9148.8,27316.2,9077.0,36193.0,68.0,9639.0,...,1.553838e+07,Manhattan,New York,15.538376,5.999398,3464.004157,106.4,59.0,15.0,18.0
4,10004,3875.0,2118.0,1757.0,793.8,2117.2,787.0,2460.0,0.0,923.0,...,1.355481e+07,Manhattan,New York,13.554813,5.233541,285.876307,124.6,5.0,3.0,0.0

In [31]:
store_cols = ['store_count', 'grocery_count', 'specialty_count']
for col in store_cols:
    merged_df[col] = merged_df[col].fillna(0)

In [32]:
merged_df['grocery_density'] = merged_df['grocery_count'] / merged_df['area_sqkm']
merged_df['specialty_density'] = merged_df['specialty_count'] / merged_df['area_sqkm']

In [33]:
merged_df = pd.merge(merged_df, income_df[['zip_code', 'Median_Household_Income']], 
                   on='zip_code', how='left')

In [34]:
merged_df.head()

,zip_code,total_population,male_population,female_population,age_under_18,age_18_to_44,age_45_plus,race_white,race_native_american,race_asian,...,area_sqkm,area_sqmi,population_density,Education Index,store_count,grocery_count,specialty_count,grocery_density,specialty_density,Median_Household_Income
0,83,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,38.300990,14.788089,NaN,NaN,0.0,0.0,0.0,0.000000,0.000000,NaN
1,10001,29079.0,14069.0,15010.0,4010.6,15181.4,6331.0,15893.0,32.0,5228.0,...,17.794941,6.870662,1634.116144,105.0,46.0,14.0,9.0,0.786740,0.505762,15097.0
2,10002,75517.0,38110.0,37407.0,10757.2,28954.8,18537.0,23597.0,262.0,27700.0,...,26.280129,10.146810,2873.539973,69.8,129.0,15.0,32.0,0.570773,1.217650,35771.0
3,10003,53825.0,26407.0,27418.0,9148.8,27316.2,9077.0,36193.0,68.0,9639.0,...,15.538376,5.999398,3464.004157,106.4,59.0,15.0,18.0,0.965352,1.158422,25080.0
4,10004,3875.0,2118.0,1757.0,793.8,2117.2,787.0,2460.0,0.0,923.0,...,13.554813,5.233541,285.876307,124.6,5.0,3.0,0.0,0.221324,0.000000,1775.0